---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.DuctInsulationThickness
source: html/46500e79-996f-8dfc-e4f5-7a0078f26deb.htm
---
# Autodesk.Revit.DB.SpecTypeId.DuctInsulationThickness Property

Duct Insulation Thickness, in discipline HVAC.

## Syntax (C#)
```csharp
public static ForgeTypeId DuctInsulationThickness { get; }
```